renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only
* intended for use with Renesas products. No other uses are authorized. This
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer         
*
* Copyright (C) 2020 Renesas Electronics Corporation. All rights reserved.
*******************************************************************************/
/*******************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 01.12.2014 1.00     First Release
*              : 20.05.2019 1.01     Supported the following compilers:
*                                    - GCC for Renesas RX
*                                    - IAR C/C++ Compiler for Renesas RX
*                                    Added comments "WAIT_LOOP".
*                                    Deleted the inline expansion of the 
*                                    R_LCDC_GetVersion function.
*                                    Deleted the "#include <machine.h>".
*              : 10.06.2020 1.02     Added support for atomic control.
*                                    Modified comment of API function to Doxygen style.
*******************************************************************************/
/*******************************************************************************
* File Name    : r_lcdc_rx.c
* Device(s)    : RX113
* Tool-Chain   : Renesas RX v3.02.00
*                GCC for Renesas RX 8.03.00.201904
*                IAR C/C++ Compiler for Renesas RX version 4.13.1
* OS           : None
* H/W Platform : RSKRX113
* Description  : Functions for using LCDC on RX devices. 
*******************************************************************************/
/*****************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include <stddef.h>
/* Fixed width integers */
#include <stdint.h>
/* Boolean defines */
#include <stdbool.h>
/* Access to peripherals and board defines. */
#include "platform.h"

/* Defines for LCDC support */
#include "r_lcdc_rx_if.h"
#include "r_lcdc_rx_config.h"
#include "r_lcdc_rx_private.h"

/*******************************************************************************
Exported global variables and functions (to be accessed by other files)
*******************************************************************************/
uint8_t g_lcdc_open_flg;
uint8_t g_lcdc_vol_method_flg;

/**********************************************************************************************************************
 * Function Name: R_LCDC_Open
 *****************************************************************************************************************/ /**
 * @brief This function initializes the LCDC to get it ready for displaying data on the LCD.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_NOT_CLOSED      Already locked
 * @retval    LCDC_ERR_UNSUPPORTED     Combination of display mode not supported
 * @retval    LCDC_ERR_NOT_OPERATE     Specified clock source not operated
 * @details   With the LCDC not locked, the initial settings listed below are performed for using the LCDC.\n
 *            \li Locks the LCDC.
 *            \li Cancels the module-stop state for the LCDC.
 *            \li Specifies the voltage boosting pin initial value switching control bit (only when the internal
 *            voltage boosting method is selected for the drive voltage generator).
 *            \li Specifies the bias method, number of time slices, and waveform.
 *            \li Configures the drive voltage generator.
 *            \li Specifies the display data area (default is A-pattern).
 *            \li Specifies the LCD clock source. \n
 *            Use the BSP_CFG_LCD_CLOCK_SOURCE constant in the BSP module to select the clock source.
 *            \li Specifies the voltage level (only when the internal voltage boosting method is selected for the drive
 *            voltage generator).
 *            \li Enables the voltage boost circuit or capacitor split circuit (only when the internal voltage boosting
 *            method or capacitor split method is selected for the drive voltage generator).
 *
 *            Perform the following before executing this function.
 *            \li Enable the LCD clock source oscillation.
 *            \li Specify the segment/common pin, and pins VL1, VL2, VL3, VL4, CAPH, and CAPL by the PmnPFS.PSEL[4:0]
 *            bits. (Set registers PMR, PDR, and PCR to 0 before setting these pins, then set the PMR register to 1
 *            after setting these pins.)
 * @note      Configure the drive voltage generator, the display waveform, the number of time slices, and the bias
 *            method in r_lcdc_rx_config.h. Use the combination of settings listed see Section 3 in the application
 *            note for details when configuring.
 */
lcdc_err_t R_LCDC_Open(void)
{
    /* The valuable for storing a return value. */
    lcdc_err_t   ret;
    /* The valuable for storing a return value for lock function. */
    bool chk;

