renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

    /* ---- CHECK OSCILLATING LCD CLOCK SOURCE ---- */
#if ( LCDC_CLK_LOCO == BSP_CFG_LCD_CLOCK_SOURCE)
     /* LOCO is chosen as LCDC clock source */
    if ( LCDC_NOT_OPERATE == SYSTEM.LOCOCR.BIT.LCSTP)
    {
        return LCDC_ERR_NOT_OPERATE;
    }
#elif ( LCDC_CLK_HOCO == BSP_CFG_LCD_CLOCK_SOURCE) 
    /* HOCO is chosen as LCDC clock source */
    if (LCDC_NOT_OPERATE == SYSTEM.HOCOCR.BIT.HCSTP)
    {
        return LCDC_ERR_NOT_OPERATE;
    }
#elif ( LCDC_CLK_MAIN == BSP_CFG_LCD_CLOCK_SOURCE) 
    /* Main clock is chosen as LCDC clock source */
    if (LCDC_NOT_OPERATE == SYSTEM.MOSCCR.BIT.MOSTP)
    {
        return LCDC_ERR_NOT_OPERATE;
    }
#elif ( LCDC_CLK_SUB == BSP_CFG_LCD_CLOCK_SOURCE) 
    /* Sub-clock is chosen as LCDC clock source */
    if ( LCDC_NOT_OPERATE == SYSTEM.SOSCCR.BIT.SOSTP)
    {
        return LCDC_ERR_NOT_OPERATE;
    }
#elif ( LCDC_CLK_IWDT == BSP_CFG_LCD_CLOCK_SOURCE) 
    /* IWDT-dedicated on-chip oscillator is chosen as LCDC clock source */
    if ( LCDC_NOT_OPERATE == SYSTEM.ILOCOCR.BIT.ILCSTP)
    {
        return LCDC_ERR_NOT_OPERATE;
    }
#endif

    /* Check combination of display mode */
#if (LCDC_WAVE_A == LCDC_CFG_DRV_WAVEFORM)
    if(LCDC_SLICE_8 == LCDC_CFG_TIME_SLICES && (LCDC_BIAS_4 == LCDC_CFG_BIAS) 
    && ((LCDC_VOL_EXTARNAL == LCDC_CFG_DRV_GENERATOR) || (LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)))
    {
        /* Do nothing */
    }
    else if((LCDC_SLICE_4 == LCDC_CFG_TIME_SLICES) && (LCDC_BIAS_3 == LCDC_CFG_BIAS))
    {
        /* Do nothing */
    }
        
    else if((LCDC_SLICE_3 == LCDC_CFG_TIME_SLICES) && ((LCDC_BIAS_3 == LCDC_CFG_BIAS) ||
    ((LCDC_BIAS_2 == LCDC_CFG_BIAS) && (LCDC_VOL_EXTARNAL == LCDC_CFG_DRV_GENERATOR))))
    {
        /* Do nothing */
    }
    
    else if ((LCDC_SLICE_2 == LCDC_CFG_TIME_SLICES) && (LCDC_BIAS_2 == LCDC_CFG_BIAS) 
    && (LCDC_VOL_EXTARNAL == LCDC_CFG_DRV_GENERATOR))
    {
        /* Do nothing */
    }
    
    else if ((LCDC_STATIC == LCDC_CFG_TIME_SLICES) && (LCDC_VOL_EXTARNAL == LCDC_CFG_DRV_GENERATOR))
    {
        /* Do nothing */
    }
    else
    {
        return LCDC_ERR_UNSUPPORTED;
    }
    
#else /* Waveform B*/
    if((LCDC_SLICE_8 == LCDC_CFG_TIME_SLICES) && (LCDC_BIAS_4 == LCDC_CFG_BIAS) &&
    ((LCDC_VOL_EXTARNAL == LCDC_CFG_DRV_GENERATOR)||(LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)))
    {
        /* Do nothing */
    }
        
    else if((LCDC_SLICE_4 == LCDC_CFG_TIME_SLICES) && (LCDC_BIAS_3 == LCDC_CFG_BIAS))
    {
        /* Do nothing */
    }
    
    else
    {
        return LCDC_ERR_UNSUPPORTED;
    }
#endif
#endif
    /*  ---- LOCKS THE LCDC ---- */
    chk = R_BSP_HardwareLock(BSP_LOCK_LCDC);

    if (false == chk)
    {
        /* Lock has already been acquired by another task. Needs to try again later. */
        return LCDC_ERR_NOT_CLOSED;
    }

    /* ---- INITIALIZE LCDC INTERNAL STATUS INFORMATION ---- */
    g_lcdc_open_flg = LCDC_NOT_OPEN;
    g_lcdc_vol_method_flg = LCDC_VOL_METHOD_INTERNAL;

    /* ---- INITIALIZE LCDC ---- */
    /* Calls the API function. */
    ret = lcdc_open();

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_open(void)
{
    /* Sets LCDC_ERR_OTHER as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;  
    
    /* Cancels the module-stop state for the LCDC. */
    power_on();
    

    /* Specifies the voltage boosting pin initial value switching control bit. */
#if (LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)
    LCDC.LCDM1.BIT.LCDVLM = 1;
#endif

    /* Specifies waveform. */
    LCDC.LCDM0.BIT.LWAVE = LCDC_CFG_DRV_WAVEFORM;
    
    /* Specifies number of time slices. */
#if (LCDC_STATIC == LCDC_CFG_TIME_SLICES)
    LCDC.LCDM0.BIT.LDTY = 0;
#elif (LCDC_SLICE_2 == LCDC_CFG_TIME_SLICES)
    LCDC.LCDM0.BIT.LDTY = 1;
#elif (LCDC_SLICE_3 == LCDC_CFG_TIME_SLICES)
    LCDC.LCDM0.BIT.LDTY = 2;
#elif (LCDC_SLICE_4 == LCDC_CFG_TIME_SLICES)
    LCDC.LCDM0.BIT.LDTY = 3;
#elif (LCDC_SLICE_8 == LCDC_CFG_TIME_SLICES)
    LCDC.LCDM0.BIT.LDTY = 5;
#endif
    
    /* Specifies the bias method. */
#if (LCDC_BIAS_2 == LCDC_CFG_BIAS)
    LCDC.LCDM0.BIT.LBAS = 0;
#elif (LCDC_BIAS_3 == LCDC_CFG_BIAS)
    LCDC.LCDM0.BIT.LBAS = 1;
#elif (LCDC_BIAS_4 == LCDC_CFG_BIAS)
    LCDC.LCDM0.BIT.LBAS = 2;
#endif

    /* Configures the drive voltage generator. */
    LCDC.LCDM0.BIT.MDSET = LCDC_CFG_DRV_GENERATOR;
    
#if(LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)
   g_lcdc_vol_method_flg = LCDC_VOL_METHOD_INTERNAL;
#elif (LCDC_VOL_CAPACITOR == LCDC_CFG_DRV_GENERATOR)
   g_lcdc_vol_method_flg = LCDC_VOL_METHOD_CAPA;
#endif
    
    /* Specifies the display data area. */
    if (LCDC_SLICE_8 !=  LCDC_CFG_TIME_SLICES)
    {
        LCDC.LCDM1.BIT.BLON = LCDC_NOT_BLINKING;
        LCDC.LCDM1.BIT.LCDSEL = LCDC_DISP_A;
    }
    
    /* Protect off of CGC. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_CGC);
    
    /* LCD source clock output is stopped. */
    SYSTEM.LCDSCLKCR2.BIT.LCDSCLKSTP = LCDC_CLK_STOP;
    
    /* Division of LCDC clock source. */
    LCDC.LCDC0.BIT.LCDC0 = LCDC_CFG_CLOCK_DIV;
    
    /* Select clock source for LCDC. */
    SYSTEM.LCDSCLKCR.BIT.LCDSCLKSEL = BSP_CFG_LCD_CLOCK_SOURCE;    
    /* WAIT_LOOP */
    while (BSP_CFG_LCD_CLOCK_SOURCE != SYSTEM.LCDSCLKCR.BIT.LCDSCLKSEL)
    {
        /* Wait for setting LCD clock source */
    }
    
    /* LCDC source clock output is start. */
    SYSTEM.LCDSCLKCR2.BIT.LCDSCLKSTP = LCDC_CLK_NOT_STOP;
    
    /* Protect on for CGC. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_CGC);

    /* Specifies the voltage level. */
#if (LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)
    LCDC.VLCD.BYTE = LCDC_CFG_REF_VCC;

    if(LCDC_CFG_REF_VCC == LCDC.VLCD.BYTE)
    {
        R_BSP_NOP();
    }

    lcdc_delay_us(LCDC_SETUP_WAIT);
#endif

