renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
    /* Enable the voltage boost circuit or capacitor split circuit. */
#if (LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR) || (LCDC_VOL_CAPACITOR == LCDC_CFG_DRV_GENERATOR)
    ret = R_LCDC_OperateCircuit(LCDC_CIRCUIT_ENABLE);
#endif
    
    /* Set open judging flag. */
    g_lcdc_open_flg = LCDC_OPEN;

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_LCDC_Write
 *****************************************************************************************************************/ /**
 * @brief This function specifies display data.
 * @param[in] seg
 *             Specify the segment to be written.
 * @param[in] data
 *             Specify display data to be written to the specified segment.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_INVALID_ARG     Invalid parameter
 * @details   Specifies the initial display data. Except for 8-time slice, store values in the lower 4 bits when
 *            writing to the A-pattern area, and in the upper 4 bits when writing to the B-pattern area.\n
 *            \li The display data is stored in the display data register.
 * @note      None
 */
lcdc_err_t R_LCDC_Write(uint8_t seg, uint8_t data)
{
    /* The valuable for storing a return value. */
    lcdc_err_t   ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

    if (39 < seg)
    {
        return LCDC_ERR_INVALID_ARG;
    }
    
#endif

    /* Calls the API function. */
    ret = lcdc_write(seg, data);

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_write(uint8_t seg, uint8_t data)
{
    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t   ret= LCDC_SUCCESS;
    
    volatile uint8_t * const  pcSEG_ADR = SEG_ADR(seg);
    
    /* The display data is stored in the display data register. */
    *pcSEG_ADR = data;

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_LCDC_Modify
 *****************************************************************************************************************/ /**
 * @brief This function is used when rewriting the display data.
 * @param[in] seg
 *             Specify the segment to be written.
 * @param[in] data_mask
 *             Set 0 to the bit to be rewritten and set 1 to the other bits. To rewrite only 1 bit, see Section 3 in
 *             the application note for details. Multiple bits can be rewritten.
 * @param[in] data
 *             Specify display data to rewrite to the specified segment.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_INVALID_ARG     Invalid parameter
 * @details   Rewrites the LCD display data in 1-bit units. If a bit is not specified for rewriting, the value stored
 *            in the bit is held as it is. Before executing this function, execute the R_LCDC_Open function. \n
 *            \li Masks the data being displayed.
 *            \li Specifies the data to rewrite
 * @note      None
 */
lcdc_err_t R_LCDC_Modify(uint8_t seg, uint8_t data_mask, uint8_t data)
{
    /* The variable for storing a return value. */
    lcdc_err_t   ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

   if (39 < seg)
   {
       return LCDC_ERR_INVALID_ARG;
   }
   
#endif

    ret = lcdc_modify(seg, data_mask, data);


    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_modify(uint8_t seg, uint8_t data_mask, uint8_t data)
{
    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;
    volatile uint8_t * const  pcSEG_ADR = SEG_ADR(seg);

    /* Masks the data being displayed. */
    *pcSEG_ADR &= data_mask;
    
    /* Specifies the data to rewrite. */
    *pcSEG_ADR |= data;

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_LCDC_DispOn
 *****************************************************************************************************************/ /**
 * @brief This function specifies display data and displays the data on the LCD.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_NOT_OPEN        R_LCDC_Open function not executed
 * @details   Displays the specified data on the LCD. Before executing this function, execute the R_LCDC_Open
 *            function. \n
 *            \li Enables display on the LCD.
 * @note      None
 */
lcdc_err_t R_LCDC_DispOn(void)
{
    /* The variable for storing a return value. */
    lcdc_err_t ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

    if (LCDC_OPEN != g_lcdc_open_flg)
    {
        return LCDC_ERR_NOT_OPEN;
    }

#endif

    /* Calls the API function. */
    ret = lcdc_dispon();

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_dispon(void)
{
    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;

    /* Enables display on the LCD. */
    LCDC.LCDM1.BIT.LCDON = LCDC_DISP_ON;
    LCDC.LCDM1.BIT.SCOC = LCDC_DISP_ENABLE;

    return ret;
}


/**********************************************************************************************************************
 * Function Name: R_LCDC_DispOff
 *****************************************************************************************************************/ /**
 * @brief This function disables display on the LCD, and stops the internal voltage boost circuit or capacitor split
 *        circuit.
 * @param[in] stop_select
 *             Select the operation, according to the specifications of the user system, whether to disable display on
 *             the LCD only or also stop the voltage boost/capacitor split circuit. \n
 *             \li LCDC_ONLY_DISPLAY_OFF: Only display on the LCD is disabled and the circuit is not stopped.
 *             \li LCDC_CIRCUIT_STOP: Display on the LCD is disabled and also the circuit is stopped.
 *
 *             This parameter can be selected only when the internal voltage boost method or capacitor split method is
 *             selected for the drive voltage generator. \n
 *             See Section 3 in the application note for details.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_INVALID_ARG     Invalid parameter
 * @details   Performs processing to disable display on the LCD only, or processing to disable display on the LCD and
 *            stop the internal voltage boost/capacitor split circuit. \n
 *            When the circuit is stopped, the drive voltage method is switched to the external resistance division
 *            method. When operating the circuit again, execute the R_LCDC_OperateCircuit function that switches the
 *            drive voltage method back to the method previously used, then execute the R_LCDC_DispOn function.
 * @note      None
 */
lcdc_err_t R_LCDC_DispOff(uint8_t stop_select)
{
    /* The variable for storing a return value. */
    lcdc_err_t   ret;

