renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1 == LCDC_CFG_PARAM_CHECKING_ENABLE)

    if((LCDC_ONLY_DISPLAY_OFF != stop_select) && (LCDC_CIRCUIT_STOP != stop_select))
    {
        return LCDC_ERR_INVALID_ARG;
    }
    
#endif

    /* Calls the API function. */
    ret = lcdc_dispoff(stop_select);

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_dispoff(uint8_t stop_select)
{
    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t   ret = LCDC_SUCCESS; 

    /* Display is disable. */
    LCDC.LCDM1.BIT.LCDON = LCDC_DISP_OFF;
    LCDC.LCDM1.BIT.SCOC = LCDC_DISP_ENABLE;

    /* If LCDC_CIRCUIT_STOP is selected, the circuit is stopped. */
    if (LCDC_CIRCUIT_STOP == stop_select)
    {
#if((LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR) || (LCDC_VOL_CAPACITOR == LCDC_CFG_DRV_GENERATOR))
        ret = R_LCDC_OperateCircuit(LCDC_CIRCUIT_DISABLE);
#endif
    }

    return ret;
}

#if((LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR) || (LCDC_VOL_CAPACITOR == LCDC_CFG_DRV_GENERATOR))
/**********************************************************************************************************************
 * Function Name: R_LCDC_OperateCircuit
 *****************************************************************************************************************/ /**
 * @brief This function enables or disables the internal voltage boost/capacitor split circuit.
 * @param[in] select_operation
 *             Select the operation whether to enable or disable the internal voltage boost/capacitor split circuit. \n
 *             \li LCDC_CIRCUIT_ENABLE: The internal voltage boost circuit or capacitor split circuit is enabled.
 *             \li LCDC_CIRCUIT_DISABLE: The internal voltage boost circuit or capacitor split circuit is disabled.
 * @retval    LCDC_SUCCESS             Processing completed successfully
 * @retval    LCDC_ERR_INVALID_ARG     Invalid parameter
 * @details   When the internal voltage boost method or capacitor split method is selected for the drive voltage
 *            generator, this function enables or disables the internal voltage boost/capacitor split circuit. \n
 *            After the circuit is enabled, the voltage boosting wait time must be processed. The user can select
 *            whether the voltage boosting wait time is processed in this function or in the user program by specifying
 *            the LCDC_CFG_VOLTAGE_WAIT constant. \n
 *            When the circuit is disabled, the drive voltage method is switched to the external resistance division
 *            method after the current circuit is stopped. When operating the circuit again, the drive voltage method
 *            is switched back to the method previously used.
 * @note      None
 */
lcdc_err_t R_LCDC_OperateCircuit(uint8_t select_operation)
{
    /* The variable for storing a return value. */
    lcdc_err_t   ret;

    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

    if((LCDC_SEL_CIRCUIT_ENABLE != select_operation) && (LCDC_SEL_CIRCUIT_DISABLE != select_operation))
    {
        return LCDC_ERR_INVALID_ARG;
    }
    
#endif

    if (LCDC_SEL_CIRCUIT_ENABLE == select_operation)
    {
        /* Calls the API function. */
        ret = lcdc_operatecircuit_enable();
    }
    
    else if (LCDC_SEL_CIRCUIT_DISABLE == select_operation)
    {
        /* Calls the API function. */
        ret = lcdc_operatecircuit_disable();
    }
    
    else
    {
        ret = LCDC_ERR_OTHER;
    }

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_operatecircuit_enable(void)
{

    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;
    uint8_t i;
    
    /* Operating the circuit again */
    if (LCDC_OPEN == g_lcdc_open_flg)
    {
        /* The drive voltage method is switch back to the method previously used. */
        if(LCDC_VOL_METHOD_INTERNAL == g_lcdc_vol_method_flg) 
        {
            LCDC.LCDM0.BIT.MDSET  = LCDC_VOL_INTERNAL;
        }
        else if (LCDC_VOL_METHOD_CAPA == g_lcdc_vol_method_flg)
        {
            LCDC.LCDM0.BIT.MDSET = LCDC_VOL_CAPACITOR;
        }
        else
        {
            ret = LCDC_ERR_OTHER;
        }
    }
    
    /* The circuit is enabled. */
    LCDC.LCDM1.BIT.VLCON = LCDC_CIRCUIT_ENABLE;
    if(LCDC_CIRCUIT_ENABLE == LCDC.LCDM1.BIT.VLCON)
    {
        R_BSP_NOP();
    }

    if ( LCDC_VOL_METHOD_INTERNAL == g_lcdc_vol_method_flg)
    {
        /* Waiting for the voltage boosting using the internal (500ms). */
        /* WAIT_LOOP */
        for (i=0; i<LCDC_BOOST_COUNTER; i++)
        {
            lcdc_delay_us(LCDC_BOOST_WAIT);
        }
   }
   else if(LCDC_VOL_METHOD_CAPA == g_lcdc_vol_method_flg)
   {
        /* Waiting for the voltage boosting using the capacitor (100ms) */
        lcdc_delay_us(LCDC_BOOST_WAIT);
   }
   else
   {
        /* Do nothing */
   }

    return ret;
}
/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_operatecircuit_disable(void)
{
    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;
    

    if (LCDC_DISP_ENABLE == LCDC.LCDM1.BIT.SCOC)
    {
        /* Display off */
        LCDC.LCDM1.BIT.SCOC = LCDC_DISP_DISABLE;
    }

    /* The circuit is disable. */
    LCDC.LCDM1.BIT.VLCON = LCDC_CIRCUIT_DISABLE;

    if(LCDC_CIRCUIT_DISABLE == LCDC.LCDM1.BIT.VLCON)
    {
        R_BSP_NOP();
    }

    /* Wait for 2 LCD clock */
    lcdc_delay_us((2*(LCDC_NS_TO_US/BSP_LCDSRCCLK_HZ))+1);

    /* Switch to the external resistance division. */
    LCDC.LCDM0.BIT.MDSET = LCDC_VOL_EXTARNAL;

    /* Display on */
    LCDC.LCDM1.BIT.SCOC = LCDC_DISP_ENABLE;

    return ret;
}
#endif


/**********************************************************************************************************************
 * Function Name: R_LCDC_Control
 *****************************************************************************************************************/ /**
 * @brief This function changes the drive voltage method and the display data area.
 * @param[in] config_pattern
 *             Specify whether to change either the drive voltage method or display data area, or both. When changing
 *             both, use OR ( | ) to specify multiple items. \n
 *             \li LCDC_FIX_DRV_GENERETOR: The drive voltage method is changed.
 *             \li LCDC_FIX_DISPLAY_AREA: The display data area is changed.
 * @param[in] select_drv_gen
 *             When "LCDC_FIX_DRV_GENERETOR" is selected for the first parameter, select one of the arguments below.
 *             When "LCDC_FIX_DRV_GENERETOR" is not selected, set "FIT_NO_PTR" for this parameter. \n
 *             \li LCDC_DRV_INTERNAL_TO_CAP: The method is changed from the internal voltage boosting method to the
 *             capacitor split method.
 *             \li LCDC_DRV_CAP_TO_INTERNAL: The method is changed from the capacitor split method to the internal
 *             voltage boosting method.
 * @param[in] select_display_area
 *             When "LCDC_FIX_DISPLAY_AREA" is selected for the first parameter, specify the new display data area by
 *             selecting one of the arguments below. When "LCDC_FIX_DISPLAY_AREA" is not selected for the first
 *             parameter, set "FIT_NO_PTR" for this parameter. \n
 *             \li LCDC_PATTERN_A: The display data area is changed from B-pattern to A-pattern.
 *             \li LCDC_PATTERN_B: The display data area is changed from A-pattern to B-pattern.
 *             \li LCDC_BLINKING: The display data area is changed to blinking with A-pattern and B-pattern.
 * @retval    LCDC_SUCCESS                  Processing completed successfully
 * @retval    LCDC_ERR_INVALID_ARG          Invalid parameter
 * @retval    LCDC_ERR_RTC_NOT_OPERATE      RTC not operated with blinking display selected
 * @details   The drive voltage method or/and the display data area can be changed. The first parameter specifies which
 *            to be changed. Also both the method and the area can be selected. \n
 *            When changing the drive voltage method: \n
 *            The drive voltage method can be changed from the internal voltage boosting method to the capacitor split
 *            method, or vice versa. The following is the procedure to change the drive voltage method. \n
 *            \li Disable display on the LCD (R_LCDC_DispOff function).
 *            \li Change the drive voltage method according to the second parameter.
 *            \li Enable display on the LCD (R_LCDC_DispOn function).
 *
 *            When changing the display data area: \n
 *            The display data area can be changed from the current setting to A-pattern, B-pattern, or blinking. \n
 *            When using blinking, the RTC is required to operate before this function is executed. To configure the 
 *            RTC, follow the steps below. \n
 *            1) Configure the clock oscillation used for the RTC. Refer to the User's Manual: Hardware for the
 *            detailed procedure. \n
 *            2) Configure the RTC settings as listed below. Refer to the User's Manual: Hardware for the detailed
 *            procedure. \n
 *            \li Periodic interrupt request: Enabled
 *            \li Periodic interrupt cycle: 1/2 second
 * @note      None
 */
lcdc_err_t R_LCDC_Control(uint8_t config_pattern, uint8_t select_drv_gen, uint8_t select_display_area)
{
    /* The variable for storing a return value. */
    lcdc_err_t   ret;

