renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
    /* ---- CHECK ARGUMENTS ---- */
#if (1U == LCDC_CFG_PARAM_CHECKING_ENABLE)

    if (LCDC_GEN_ERR_CON == config_pattern)
    {
        return LCDC_ERR_INVALID_ARG;
    }
    
#endif


    /* Calls the API function. */
    ret = lcdc_conrtol(config_pattern, select_drv_gen, select_display_area);

    return ret;
}

/*---------------------------------------------------------------------------*/
static lcdc_err_t lcdc_conrtol(uint8_t config_pattern, uint8_t select_drv_gen, uint8_t select_display_area)
{

    /* Sets LCDC_SUCCESS as initialization of ret. */
    lcdc_err_t ret = LCDC_SUCCESS;
    
    /* Changing the drive voltage method. */
    if((config_pattern & LCDC_FIX_DRV_GENERETOR) == LCDC_FIX_DRV_GENERETOR)
    {

        /* Display off */
        ret = R_LCDC_DispOff(LCDC_ONLY_DISPLAY_OFF);
        
        /* Switch to capacitor split method from internal voltage boosting method. */
        if(LCDC_DRV_INTERNAL_TO_CAPA == select_drv_gen)
        { 
            LCDC.LCDM0.BIT.MDSET = LCDC_VOL_CAPACITOR;
            g_lcdc_vol_method_flg = LCDC_VOL_METHOD_CAPA;
        }
 
        /* Switch to internal voltage boosting method from capacitor spilit method. */
        else if(LCDC_DRV_CAPA_TO_INTERNAL == select_drv_gen) 
        {
            LCDC.LCDM0.BIT.MDSET = LCDC_VOL_INTERNAL;
            g_lcdc_vol_method_flg = LCDC_VOL_METHOD_INTERNAL;
        }
        else
        {
            ret = LCDC_ERR_OTHER;
        }

        /* Display on */
        ret = R_LCDC_DispOn();
    }
    
    /* Changing the display data area. */
    if((config_pattern & LCDC_FIX_DISPLAY_AREA) == LCDC_FIX_DISPLAY_AREA)
    {
        /* Switch to A-pattern from B-pattern or blinking. */
        if (LCDC_PATTERN_A == select_display_area)
        {
            LCDC.LCDM1.BIT.BLON = LCDC_NOT_BLINKING;
            LCDC.LCDM1.BIT.LCDSEL = LCDC_DISP_A;
        }
        
        /* Switch to B-pattern from A-pattern */
        else if(LCDC_PATTERN_B == select_display_area)
        {
            LCDC.LCDM1.BIT.BLON = LCDC_NOT_BLINKING;
            LCDC.LCDM1.BIT.LCDSEL = LCDC_DISP_B;
        }

        /* Switch to blinking. */
        else if (LCDC_PATTERN_BLINKING == select_display_area)
        {
            /* If Clock source of RTC is disabled. */
            if(0 == RTC.RCR3.BIT.RTCEN)
            {
                /* Return error. */
                ret = LCDC_ERR_RTC_NOT_OPERATE;
            }
            
            /* If IWDT clock source is selected as LCDC clock source */
            if (LCDC_CLK_IWDT == BSP_CFG_LCD_CLOCK_SOURCE)
            {
                /* Return error. */
                ret = LCDC_ERR_UNSUPPORTED;
            }
            
            LCDC.LCDM1.BIT.BLON = LCDC_BLINKING;
            LCDC.LCDM1.BIT.LCDSEL = LCDC_DISP_A;
        }
        
        else
        {
            ret = LCDC_ERR_OTHER;
        }
    }

    return ret;
}

#if(LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)
/**********************************************************************************************************************
 * Function Name: R_LCDC_AdjustContrast
 *****************************************************************************************************************/ /**
 * @brief This function adjusts the contrast. \n
 *        This function can be selected when the internal voltage boosting method is used for the drive voltage
 *        generator.
 * @param[in] select_read_adjust
 *             Specify one of the following to this parameter. \n
 *             \li LCDC_VOL_READ: The current voltage level is read.
 *             \li LCDC_VOL_ADJUST: The voltage is changed to adjust the contrast.
 * @param[in] updown_level
 *             When "LCDC_VOL_READ" is selected for the first parameter, set this argument to 0. \n
 *             When "LCD_VOL_ADJUST" is selected, set the voltage step to change from -15 to 15. For example, set '3'
 *             to specify the voltage level that is 3 steps higher than the current level. Set '-1' to specify the
 *             voltage level that is 1 step lower than the current level.
 * @retval    LCDC_VOL_LEVEL                  Current voltage level returned when processing completed successfully.
 *                                            If the voltage level is changed, then the changed level is returned.
 * @retval    LCDC_ERR_OUTSIDE_VOLTAGE        Invalid voltage (outside the range)
 * @details   The voltage level is read or the voltage level is adjusted (contrast adjustment) according to the first
 *            parameter. \n
 *            When LCDC_VOL_READ is selected for the first parameter: \n
 *            The current voltage level is returned as the return value. \n
 *            When LCDC_VOL_ADJUST is selected for the first parameter: \n
 *            The current voltage level is changed according to the value passed by the first parameter. The following
 *            is the procedure to change the voltage level.
 *            \li Verify the specified level is within the selectable range.
 *            \li Stop the internal voltage boost/capacitor split circuit.
 *            \li Change the voltage level according to the specified value in the parameter.
 *            \li Enable the internal voltage boost/capacitor split circuit.
 *            \li Wait for the reference voltage setup wait time.
 *
 *            See Section 3 in the application note for details.
 * @note      None
 */
int8_t R_LCDC_AdjustContrast(uint8_t select_read_adjust, int8_t updown_level)
{
    /* The valuable for storing a return value. */
    int8_t   ret;

    if(LCDC_VOL_READ == select_read_adjust)
    {
        /* Return the current voltage level */
        ret = (int8_t)LCDC.VLCD.BYTE;
    }
    
    else if(LCDC_VOL_ADJUST == select_read_adjust)
    {
       /* Calls the API function. */
       ret = lcdc_adjustcontrast(updown_level);
    }
    
    else
    {
        ret = LCDC_ERR_OTHER;
    }


    return ret;
}

