renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
/*---------------------------------------------------------------------------*/
int8_t lcdc_adjustcontrast(int8_t updown_level)
{
    /* The valuable for storing a return value. */
    int8_t ret; 
    /* The valuable for storing the current voltage. */
    uint8_t now_vol;
    /* The valuable for storing the voltage level after change */
    int8_t  new_vol;
    
    /* Verify the specified level is within the select range. */
    now_vol = LCDC.VLCD.BIT.VLCD;
    new_vol = (int8_t)(now_vol + updown_level);
    
    if ((LCDC_BIAS_2 == LCDC_CFG_BIAS) || (LCDC_BIAS_3 == LCDC_CFG_BIAS))
    {
        if((new_vol < LCDC_VOL_MIN) || (LCDC_VOL_MAX < new_vol))
        {
            R_BSP_NOP();
            return LCDC_ERR_OUTSIDE_VOLTAGE;
        }
    }
    else if (LCDC_BIAS_4 == LCDC_CFG_BIAS)
    {
        if((new_vol < LCDC_VOL_MIN) || (LCDC_VOL_MAX_4BIAS < new_vol))
        {
            return LCDC_ERR_OUTSIDE_VOLTAGE;
        }
    }
    else
    {
        ret = LCDC_ERR_OTHER;
    }

    /* Stop the internal voltage boost/capacitor split circuit. */
    R_LCDC_OperateCircuit(LCDC_CIRCUIT_DISABLE);
    
    /* Change the voltage level according to he specified value. */
    LCDC.VLCD.BYTE = (uint8_t)new_vol;

    if((uint8_t)new_vol == LCDC.VLCD.BYTE)
    {
        R_BSP_NOP();
    }

    /* Wait for the reference voltage setup wait time. */
    lcdc_delay_us(LCDC_SETUP_WAIT);
    
    /* Enable the internal voltage boost/capacitor spilit circuit. */
    R_LCDC_OperateCircuit(LCDC_CIRCUIT_ENABLE);

    ret = new_vol;
    
    return ret;
}
#endif

/**********************************************************************************************************************
 * Function Name: R_LCDC_Close
 *****************************************************************************************************************/ /**
 * @brief This function stops the LCDC.
 * @retval    LCDC_SUCCESS        Processing completed successfully
 * @details   The LCDC is stopped. Make sure to stop the voltage boost/capacitor split circuit before executing this
 *            function. \n
 *            The following is the procedure to stop the LCDC. \n
 *            \li Initializes the values in the LCD registers and flags.
 *            \li Enters the state to stop the LCD clock source.
 *            \li Enters the LCDC module-stop state.
 *            \li Unlocks the LCDC.
 * @note      None
 */
lcdc_err_t R_LCDC_Close(void)
{    
    /* The valuable for storing a return value for lock function. */
    bool chk;

    /* ---- Calls the API function. ---- */
    lcdc_close();

    /* ---- Hardware Unlock ---- */
    chk = R_BSP_HardwareUnlock(BSP_LOCK_LCDC);

    if (false == chk)
    {
        return  LCDC_ERR_NOT_CLOSED;
    }
    
    /* ---- Enters the LCDC module-stop state. ---- */
    power_off();

    return LCDC_SUCCESS;
}

/*---------------------------------------------------------------------------*/
static void lcdc_close(void)
{
    uint8_t cnt;

    /* WAIT_LOOP */
    for (cnt=0; cnt < 40; cnt++)
    {
        R_LCDC_Write(cnt,0x00);
    }

    /* ---- Initial register value ---- */
    /* Initialize the voltage boosting pin initial value switching control bit. */
    LCDC.LCDM1.BIT.LCDVLM = LCDC_INIT_LCDVLM;

    /* Initialize waveform bit.(Waveform A) */
    LCDC.LCDM0.BIT.LWAVE = LCDC_INIT_WAVE;
    
    /* Initialize time slices bit. (Static) */
    LCDC.LCDM0.BIT.LDTY = LCDC_INIT_SLICE;

    /* Initialize the bias method select bit. (1/2 bias method) */
    LCDC.LCDM0.BIT.LBAS = LCDC_INIT_BIAS;

    /* Initialize the LCDC driver voltage generator select bit. (External resistance division method) */
    LCDC.LCDM0.BIT.MDSET = LCDC_INIT_MDSET;

    /* Initialize the LCDC display. (Output ground level to segment/common pin) */
    LCDC.LCDM1.BIT.SCOC = LCDC_INIT_SCOC;

    /* Initialize LCD boost level control register. */
#if (LCDC_VOL_INTERNAL == LCDC_CFG_DRV_GENERATOR)
    LCDC.VLCD.BYTE = LCDC_INIT_VOL;

    if(LCDC_INIT_VOL == LCDC.VLCD.BYTE)
    {
        R_BSP_NOP();
    }

/* Wait for the reference voltage setup wait time. */
    lcdc_delay_us(LCDC_SETUP_WAIT);
#endif

    /* ---- Initialize the valuable ---- */
    g_lcdc_vol_method_flg = LCDC_VOL_METHOD_INTERNAL;
    g_lcdc_open_flg = LCDC_NOT_OPEN;

    /* Reset div for lcdc */
    LCDC.LCDC0.BIT.LCDC0 = LCDC_INIT_DIV;

    /* Reset lcdc clock source */
    SYSTEM.LCDSCLKCR.BIT.LCDSCLKSEL = LCDC_INIT_LCDCLK; 

    /* Stop output of lcdc clock source */
    SYSTEM.LCDSCLKCR2.BIT.LCDSCLKSTP = LCDC_INIT_CLKSTP;

}


/**********************************************************************************************************************
 * Function Name: R_LCDC_GetVersion
 *****************************************************************************************************************/ /**
 * @brief This function returns the API version.
 * @return    Version number
 * @details   Returns the API version number.
 * @note      None
 */
uint32_t  R_LCDC_GetVersion(void)
{
    uint32_t const version = ((LCDC_VERSION_MAJOR << 16) | LCDC_VERSION_MINOR);

    return version;
}


/************************************************************************************
* Function Name: power_on
* Description : Turns on power to a LCDC.
* Arguments : none
* Return Value : none
************************************************************************************/
static void power_on(void)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Bring module out of stop state. */
    MSTP(LCDC) = 0;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}

/************************************************************************************
* Function Name: power_off
* Description : Turns off power to a LCDC channel.
* Arguments : none
* Return Value : none
************************************************************************************/
static void power_off(void)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    bsp_int_ctrl_t int_ctrl;
#endif

    /* Enable writing to MSTP registers. */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    /* Put module in stop state. */
    MSTP(LCDC) = 1;

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    /* Disable writing to MSTP registers. */
    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
}

