renesas/rx-driver-package/source/r_lcdc_rx/r_lcdc_rx_vx.xx/r_lcdc_rx/src/targets/rx113/r_lcdc_rx.c
/*******************************************************************************
* Outline      : WAIT processing which can be performed in a fixed cycle
* Header       : none
* Function Name: R_DELAY
* Description  : The function waits until the arbitrary cycles shown in R1 pass.
* Arguments    : R1 : Waiting loop counter
* Return Value : none
*******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE_ASM(lcdc_delay)
void lcdc_delay  (uint32_t loop_cnt)
{
    R_BSP_ASM_INTERNAL_USED(loop_cnt)
    R_BSP_ASM_BEGIN
    R_BSP_ASM(    BRA.B   R_BSP_ASM_LAB_NEXT(0)    )
    R_BSP_ASM(    NOP                              )
    R_BSP_ASM_LAB(0:                               )
    R_BSP_ASM(    NOP                              )
    R_BSP_ASM(    SUB     #01H,R1                  )
    R_BSP_ASM(    BNE.B   R_BSP_ASM_LAB_PREV(0)    )
    R_BSP_ASM_END
}

/*******************************************************************************
* Outline      : WAIT processing which can be performed in a fixed cycle
               : (for several us)
* Header       : none
* Function Name: R_DELAY_Us
* Description  : The function performed in the fixed cycle is called and
               : It waits for the WAIT time for several us.
* Arguments    : R1 : Waiting time(us)
* Return Value : LCDC_SUCCESS         : Success
               : LCDC_INVALID_ARG : Invalid argument
*******************************************************************************/
lcdc_err_t lcdc_delay_us (uint32_t delay_us)
{


    uint32_t loop_cnt; /* Argument of R_DELAY function */

    /* Calculation of a loop count */

    loop_cnt = (uint32_t)(delay_us * (uint32_t)(((((BSP_ICLK_HZ / 1000.0) / (5.0 * 1000)) * 1024 )) + 0.9));
    loop_cnt >>= 10UL;

    /* R_DELAY function is performed when loop_cnt is 1 or more. */

    if(loop_cnt != 0)
    {

        lcdc_delay((uint32_t)loop_cnt);

    }
#if LCDC_CFG_PARAM_CHECKING_ENABLE  == 1

    else
    {
        return LCDC_ERR_INVALID_ARG;
    }

#endif

    return LCDC_SUCCESS;

}


/* end of file */
